Documentation/Source/Setting_Up.org
#+TITLE: Setting Up Zambia from Scratch
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy, Bendyogagirl
#+DATE: July 2011
#+DESCRIPTION: Zambia is a piece of Con Management Software.  This document is a "How To" guide to help set up your Zambia FFF-branch instance from scratch for your convention.  This is still a work in progress.
#+KEYWORDS: Zambia, Documentation, FFF branch
#+LANGUAGE: en
#+OPTIONS: \n:nil ^:nil timestamp:nil creator:nil H:3 num:3 toc:nil @:t ::nil |:t -:t todo:nil tasks:nil tags:nil <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+STARTUP: fninline
#+SETUPFILE: "Headers/setupfile.org"
#+INCLUDE: "Headers/include.org"
#+TOC: headlines 3
#+LaTeX: \listoftables
#+LaTeX: \listoffigures
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* Before beginning

  There are some required programs to run the Zambia software.  The
  following programs must be running on whatever server is going to
  serve up your Zambia instance: (LAMP or WAMP (WAMP is untested))
  + apache
  + php
  + mysql
  + some form of email sending software (MTA)
  + SFTP/SCP

  Either on your staging machine (where you will be uploading the
  information from) or on your server (if you are loading directly to
  there) you must also have:
  + svn
  + text editing program
** Definitions
#+CAPTION: Acronyms and Definitions
#+LABEL: tbl:acronymsdefinitions
#+ATTR_LaTeX: :environment longtable :width 0.98\textwidth :align |p{3.5cm}|p{13.4cm}|
#+ATTR_HTML: :border 1 :rules all :frame border
|-----------------+--------------------------------------------------------------------------------------------------------------------------------------------------|
| Acronym or Term | Definition                                                                                                                                       |
|-----------------+--------------------------------------------------------------------------------------------------------------------------------------------------|
| precis          | An element in your schedule.  Could be a class, panel, gathering, party, room-coverage, lounge, or whatever else you might have on your schedule |
| LAMP            | Linux + Apache + MySQL + PHP/Perl/Python                                                                                                         |
| WAMP            | Windows + Apache + MySQL + PHP/Perl/Python                                                                                                       |
|-----------------+--------------------------------------------------------------------------------------------------------------------------------------------------|

** Decisions
   You will need to decide the following before you install initially:
*** Standalone/Combination
    Is this system going to be a standalone system, or are you going
    to interface it with Congo, or another piece of registration software?
*** Single/Multiple installation
    Is this going to be a single instantce of Zambia, or are you going
    to have multiple instances of Zambia running on the same machine
    with some shared resources?
*** Webserver
    Where is your web installation location (whatever directory you
    will be putting your files into)?  Often something like
    /var/www/Zambia-Con or /home/username/public_html/Zambia-Con or
    the like.
*** db_name.php file
    This information will go in the db_name.php file when you install it.
