Documentation/Setting_Up.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Setting Up Zambia from Scratch</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Percy, Bendyogagirl" />
<meta  name="description" content="Zambia is a piece of Con Management Software.  This document is a &quot;How To&quot; guide to help set up your Zambia FFF-branch instance from scratch for your convention.  This is still a work in progress."
 />
<meta  name="keywords" content="Zambia, Documentation, FFF branch" />
</head>
<body>
<div id="content">
<h1 class="title">Setting Up Zambia from Scratch</h1>
<p>

</p>
<p>
Setting Up Zambia from Scratch
</p>
<p>
Percy, Bendyogagirl &lt;NELA.Percy@gmail.com&gt;
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Before beginning</a>
<ul>
<li><a href="#sec-1-1">1.1. Definitions</a></li>
<li><a href="#sec-1-2">1.2. Decisions</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Standalone/Combination</a></li>
<li><a href="#sec-1-2-2">1.2.2. Single/Multiple installation</a></li>
<li><a href="#sec-1-2-3">1.2.3. Webserver</a></li>
<li><a href="#sec-1-2-4">1.2.4. db_name.php file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Downloading</a></li>
<li><a href="#sec-3">3. Local file setup</a>
<ul>
<li><a href="#sec-3-1">3.1. db_name.php</a></li>
<li><a href="#sec-3-2">3.2. FooterTemplate.html</a></li>
<li><a href="#sec-3-3">3.3. HeaderTemplate.html</a></li>
<li><a href="#sec-3-4">3.4. Participant_Images</a></li>
<li><a href="#sec-3-5">3.5. Verbiage</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. BrainstormWelcome_0</a></li>
<li><a href="#sec-3-5-2">3.5.2. Introduction_Blurb_0</a></li>
<li><a href="#sec-3-5-3">3.5.3. Schedule_Blurb_0</a></li>
<li><a href="#sec-3-5-4">3.5.4. StaffPage_0</a></li>
<li><a href="#sec-3-5-5">3.5.5. Volunteer_Jobs_0</a></li>
<li><a href="#sec-3-5-6">3.5.6. Welcome_Letter_Presenters_0</a></li>
<li><a href="#sec-3-5-7">3.5.7. Welcome_Letter_Presenters_and_Volunteers_0</a></li>
<li><a href="#sec-3-5-8">3.5.8. Welcome_Letter_Volunteers_0</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Database setup</a>
<ul>
<li><a href="#sec-4-1">4.1. Hosted server</a></li>
<li><a href="#sec-4-2">4.2. Your own MySQL Setup</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Database populate</a></li>
<li><a href="#sec-6">6. Database tweaks</a></li>
<li><a href="#sec-7">7. Account creation</a>
<ul>
<li><a href="#sec-7-1">7.1. Standalone</a></li>
<li><a href="#sec-7-2">7.2. Congo</a></li>
<li><a href="#sec-7-3">7.3. Not Congo</a></li>
</ul>
</li>
<li><a href="#sec-8">8. First steps</a>
<ul>
<li><a href="#sec-8-1">8.1. Schedule</a></li>
<li><a href="#sec-8-2">8.2. Brainstorming</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Backing up</a></li>
<li><a href="#sec-10">10. Quick and dirty</a></li>
<li><a href="#sec-11">11. Adding a year instance - Con Structure</a>
<ul>
<li><a href="#sec-11-1">11.1. ConInfo</a></li>
<li><a href="#sec-11-2">11.2. Phase</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Adding a year instance - People</a>
<ul>
<li><a href="#sec-12-1">12.1. UserHasPermissionRole</a></li>
<li><a href="#sec-12-2">12.2. UserHasConRole</a></li>
<li><a href="#sec-12-3">12.3. HasReports</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Adding a year instance - Sessions</a>
<ul>
<li><a href="#sec-13-1">13.1. PublicationLimits</a></li>
<li><a href="#sec-13-2">13.2. Services and Features</a></li>
<li><a href="#sec-13-3">13.3. Rooms</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Adding a year instance - Vendors</a>
<ul>
<li><a href="#sec-14-1">14.1. VendorSpaces and VendorFeatures</a></li>
<li><a href="#sec-14-2">14.2. More Vendor stuff, pending development.</a></li>
</ul>
</li>
<li><a href="#sec-15">15. Adding a year instance - Feedback</a>
<ul>
<li><a href="#sec-15-1">15.1. Adding Questions</a></li>
<li><a href="#sec-15-2">15.2. Setting up the page description (how it is presented)</a></li>
<li><a href="#sec-15-3">15.3. Setting the TypeHasQuestionType</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Before beginning</h2>
<div class="outline-text-2" id="text-1">
<p>
There are some required programs to run the Zambia software.  The
following programs must be running on whatever server is going to
serve up your Zambia instance: (LAMP or WAMP (WAMP is untested))
</p>
<ul class="org-ul">
<li>apache
</li>
<li>php
</li>
<li>mysql
</li>
<li>some form of email sending software (MTA)
</li>
<li>SFTP/SCP
</li>
</ul>

<p>
Either on your staging machine (where you will be uploading the
information from) or on your server (if you are loading directly to
there) you must also have:
</p>
<ul class="org-ul">
<li>svn
</li>
<li>text editing program
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Definitions</h3>
<div class="outline-text-3" id="text-1-1">
<table id="tbl:acronymsdefinitions" border="1" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption align="above"><span class="table-number">Table 1:</span> Acronyms and Definitions</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Acronym or Term</th>
<th scope="col" class="left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">precis</td>
<td class="left">An element in your schedule.  Could be a class, panel, gathering, party, room-coverage, lounge, or whatever else you might have on your schedule</td>
</tr>

<tr>
<td class="left">LAMP</td>
<td class="left">Linux + Apache + MySQL + PHP/Perl/Python</td>
</tr>

<tr>
<td class="left">WAMP</td>
<td class="left">Windows + Apache + MySQL + PHP/Perl/Python</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Decisions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
You will need to decide the following before you install initially:
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Standalone/Combination</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Is this system going to be a standalone system, or are you going
to interface it with Congo, or another piece of registration software?
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Single/Multiple installation</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Is this going to be a single instantce of Zambia, or are you going
to have multiple instances of Zambia running on the same machine
with some shared resources?
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Webserver</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Where is your web installation location (whatever directory you
will be putting your files into)?  Often something like
/var/www/Zambia-Con or /home/username/public_html/Zambia-Con or
the like.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> db_name.php file</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
This information will go in the db_name.php file when you install it.
</p>
</div>
