Documentation/Setting_Up.html
<ul class="org-ul"><li>Required information for the program to run:<br  /><div class="outline-text-5" id="text-1-2-4-1">
<ul class="org-ul">
<li>Database hostname (<b>DBHOSTNAME</b>). If you are setting things up on
the same machine that MySQL is running on, <i>localhost</i> should be
what you are using for <b>DBHOSTNAME</b>.
</li>
<li>Database username (<b>DBUSERNAME</b>).  The user created for the
Zambia program to access the database(s).
</li>
<li>Database password (<b>DBPASSOWRD</b>).  The password created for the
Zambia program to access the database(s).
</li>
<li>Main database name (<b>DBDB</b>).  The database for all the single
convention specific information to live in.
</li>
<li>Biographical information database name (<b>BIODB</b>).  The database
for all the (possibly shared between Zambia instances)
biographical data.  If you are having the same people either for
multiple years, or for multiple activities, it makes sense to
centralize the information, otherwise it could be a one-shot for
the particular convention.
</li>
<li>The Reports databasse name (<b>REPORTDB</b>) points to where the
reports are kept.  It is on of the main ways of interation with
the data about the convention.  If you have multiple Zambia
instances it makes sense for this to be a single, shared
resource.
</li>
<li>The CongoDump database name (<b>CONGODB</b>). Congo is another piece of
software designed to interact with Zambia. The information in
that set of databases can be accessed in a variety of ways.
</li>
<li>The Limits (<b>LIMITDB</b>) and Localizations (<b>LOCALDB</b>) databases
are used to key things that are specific to a convention, but
might all want to live in a central database, for ease of
deploying new conventions.
</li>
<li>The TimeCard database (<b>TIMECARDDB</b>) might want to be specific to
a convention, or generalized across many different activities of
your organization, it often is local to the convention instance,
but there are some reasons to have it in a single, externally
served database.
</li>
<li>The convention database keying tag (<b>CON_KEY</b>) is useful when the
Limits and Localizations are stored in a single table, to
distinguish between which instance needs to be pulled.
</li>
<li>your host name (<b>MYHOST</b>) (If you are setting things up on the same
machine that MySQL is running on, <i>localhost</i> should be what you
are using for <b>MYHOST</b>) (this doesn't actually go in the file)
</li>
</ul>
</div>
</li>

<li>Extremely useful information:<br  /><div class="outline-text-5" id="text-1-2-4-2">
<p>
Most of this information, currently in the db_name.php file,
would all be candidtates to be inthe Localization database.
</p>
<ul class="org-ul">
<li>Con name.
</li>
<li>Zambia administrator email.
</li>
<li>Brainstorm email.
</li>
<li>Programming email.
</li>
<li>Registration email.
</li>
<li>Number of days the con will run (code works for 1-8 currently.)
</li>
<li>Date and time the con will start (In the format of yyyy-mm-dd
HH:MM:DD for parsing purposes.  Suggested 00:00:00 for the
start time.)
</li>
<li>URL of the con (without the leading <a href="http://">http://</a> in the URL.)
</li>
<li>Logo for the con (gif, png, etc.)
</li>
<li>Availabilty Records (starting number of "availability" fields
to render in the "when I am available" form, 8 is a good
default.)
</li>
<li>Are kids avaiable (This should probably be set to "FALSE", it
is a hold-over from backwards compatibility.)
</li>
<li>Default Duration of the classes. (How long, in H:MM format that
the classes are expected to be.)
</li>
<li>Duration in Minutes (Should probably be "FALSE": TRUE: in mmm;
False: in hh:mm - affects session edit/create page only, not
reports.)
</li>
<li>Grid Spacer (The time divisions in the fixed grid produced, in
seconds.  For example 1800 is 60 sec/min and 30 min, and a good
default.)
</li>
</ul>
</div>
</li>

<li>Very useful information<br  /><div class="outline-text-5" id="text-1-2-4-3">
<ul class="org-ul">
<li>Guests of Honor badgelist (if you have specific featured Guests
of Honor, the badgeids get listed here, comma seperated.)
(This is being migrated as a flag for a presenter.)
</li>
<li>Prefered total number of sessions upper limit (so your
presenters don't oversubscribe themselves 5 is good default for
a 3-4 day con.) (This should move to the Limits database.)
</li>
<li>Prefered daily number of sessions upper limit (3 is a good
default.) (This should move to the Limits database.)
</li>
</ul>
</div>
</li>

<li>Description minimums and maximums<br  /><div class="outline-text-5" id="text-1-2-4-4">
<p>
All of this information should be migrated to the Limits
database.  Only set a value if you need it, unset values are
simply presume there is no limit to the information in that
direction.  At some point, the precis descriptions will be folded
into the same, or a similar structure to the Biographical
Information is, currently.
</p>
<ul class="org-ul">
<li>Minimum web biography character length (Some cons have minimum
biographical information requirements.)
</li>
<li>Maximum web biography character length (Some cons have a
different limits for what is on the web, and what is in the
book, 3000 characters is a good starting default for the WWW.)
</li>
<li>Minimum book biography character length (Some cons have minimum
biographical information requirements.)
</li>
<li>Maximum book biography character length (if there isn't a
difference in the limit, but still, there is a limit, set to
the same as the web maximum.)
</li>
<li>Minimum uri biography character length (the URI block is often
unlimited in either direction.)
</li>
<li>Maximum uri biography character length (the URI block is often
unlimited in either direction.)
</li>
<li>Minimum picture biography character length (the picture line is
often unlimited in either direction.)
</li>
<li>Maximum picture biography character length (the picture line is
often unlimited in either direction.)
</li>
<li>Minimum web precis character length (You need a precis
description of at least this long to be acceptable, 10 as a
good default.)
</li>
<li>Maximum web precis character length (3000 as a good default.)
</li>
<li>Minimum book precis character length (if there isn't a
difference in the limit, set it to the same as above for these,
as well.)
</li>
<li>Maximum book precis character length
</li>
<li>Minimum precis title character length (You need a precis title
of at least this long to be acceptable, 5 as a good default.)
</li>
<li>Maximum precis title character length (50 as a good default.)
</li>
<li>Minimum name character length (if there is a need to make sure
all names are of at least a specifc length.)
</li>
<li>Maximum name character length (if there is a need to make sure
all names are no more than a specifc length.)
</li>
</ul>
</div>
</li>

<li>Other interesting settings<br  /><div class="outline-text-5" id="text-1-2-4-5">
<p>
The linguistic settings (below) will go away once the precis
descriptions are migrated to a similar format as the Biographical
information currently resides.
</p>
<ul class="org-ul">
<li>Is this a bilingual event (This should probably be set to
"FALSE" due to it's lack of complete support across the system,
and the next few elements in this list, ignored.)
</li>
<li>What the second language is.
</li>
<li>Title caption in second language.
</li>
<li>Description caption in second language.
</li>
<li>Biography caption in second language.
</li>
</ul>
</div>
</li>

<li>The rest of the file should not have to change.<br  /></li></ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Downloading</h2>
<div class="outline-text-2" id="text-2">
<p>
If you are checking the code out directly on the hosting machine,
replace the final "Zambia" with what you decided the web install
location will be.  If not, you can rename it to whatever you wish to
call your staging area.
</p>

<p>
Please, check out the code from:
</p>

<p>
svn co <a href="https://zambia.svn.sourceforge.net/svnroot/zambia/branches/FFF/">https://zambia.svn.sourceforge.net/svnroot/zambia/branches/FFF/</a> Zambia
</p>
</div>
</div>
