Documentation/Source/Setting_Up.org
* Local file setup
  There are certain localisms you want to set up, outside the svn
  tree. This is so (should you need to) if an upgrade to the code-base
  is desired, it can be done, without writing over your
  customizations.

  To begin the process change to your web install location.  There you
  should see a list of files, and you will add one called "Local".
  When done your list of files should be:
  These files you will have to create or modify.
** db_name.php
     Copy the example webpages/db_name_sample.php to Local/db_name.php
     as a start, and then put in the values you decided upon before
     starting the install process.
** FooterTemplate.html
     This is where you will put your standard footer, that will be
     below all the public pages, to customize the look and feel to
     match your event's presentation.
** HeaderTemplate.html
     This is where you will put your standard header, that will be
     above all the public pages, to customize the look and feel to
     match your event's presentation.
** Participant_Images
     If you choose to have images of your participants with their
     bios, make this directory, and any pictures that match the
     badgename of the participant will be put next to the bios.
** Verbiage
     If you wish to customize what is put forth to your participants,
     many of the pages allow for customization.  The list of them will
     grow as more are done.  Any information in these files will
     replace the default text.  Some examples of these files are:
*** BrainstormWelcome_0
#+begin_src html :exports both :results silent
<P> Here you can submit new suggestions or look at existing ideas for
panels, Meet and Greets, Special Interest Groups, Birds Of a Feathers,
Author Readings, and Author Signings.</P>
<P> As suggestions come in and we read through them, we will rework
them, combine similar ideas into a single item, split large ones into
pieces that will fit in their alloted time, etc.  Please expect the
suggestions you submit to evolve over time.</P>
<P> Also, please note that we always have more suggestions than are
physically possible with the space and time we have, so not everything
will make it.  We do save good ideas for future conventions.</P>
<UL>
  <LI> <A HREF="BrainstormSearchSession.php">Search</A> for similar
  ideas or get inspiration.
  <LI> Email <A HREF="mailto:program@ourcon.org">
  program@ourcon.org</A> to suggest modifications on existing
  suggestion.
  <LI> <A HREF="BrainstormCreateSession.php">Enter a panel, MnG, SIG,
  BOF, et al suggestion.</A>
  <LI> <A HREF="BrainstormSuggestPresenter.php">Enter a suggestion for
  a Presenter.</A>
  <LI> See the list of <A HREF="BrainstormReportAll.php">All</A>
  suggestions (we've seen some and not see others).
  <LI> See the list of <A HREF="BrainstormReportUnseen.php">New</A>
  suggestions that have been entered recently (may not be fit for
  young eyes, we haven't see these yet).
  <LI> See the list of <A HREF="BrainstormReportReviewed.php">
  Reviewed</A> suggestions we are currently working through.
  <LI> See the list of <A HREF="BrainstormReportLikely.php">Likely to
  Occur</A> suggestions we are or will allow participants to sign up
  for.
  <LI> See the list of <A HREF="BrainstormReportScheduled.php">
  Scheduled</A> suggestions.  These are very likely to happen at con.
  <LI> Email <A HREF="mailto:vols@ourcon.org">vols@ourcon.org</A> to
  volunteer to help process these ideas.
</UL>
#+end_src
*** Introduction_Blurb_0
#+begin_src html :exports both :results silent
and before I introduce our speaker, let me ask, How many of you are
new?  Well, let me tell you, you are in for one heck of a ride.<br
#+end_src
*** Schedule_Blurb_0
#+begin_src html :exports both :results silent
Welcome to the Circus Fantastique.  We really appreciate all your
efforts to make this weekend go so well.  Below is your schedule for
the weekend.  If you have any questions, please, do not hesitate to
find our staff in the Green Room, or whomever our point-person is at
that time.  </P><P>I hope you will have all the fun you can!<hr>
#+end_src
*** StaffPage_0
#+begin_src html :exports both :results silent
<P> Please note the tabs above.  One of them will take you to your
participant view.  Another will allow you to manage Sessions.  Note
that Sessions is the generic term we are using for all Events,
Classes, Panels, BOF/SIG/MnG, other activities, etc. </P>

<P>Current roles:
<UL>
  <LI>Pre-con Logistics: That tall guy, with the 'stash
  <LI>At-con Logistics: Bill(1)
  <LI>Speaker Liaison: Kat (with a "K")
  <LI>Assistant Speaker Liaison: Bill(2)
  <LI>Volunteer Captain: Cat
  <LI>Assistant Volunteer Captain: The Other Cat
  <LI>Green Room Czar: Tim
  <LI>Point People: Helium 1, Helium 2, and the Stupid But Cute.
  <LI>Schedule Wranglers: The group as a whole
  <LI>Technical support: Will
  <LI>(Tentative) Technical Support: Nyot
  <LI>Bio/copy editing: Rupert
</UL></P>

<P>The general flow of sessions over time is: <UL> <LI>Brainstorm -
New session idea put in to the system by one of our brainstorm
users. The idea may or may not be sane or good.  It could be too big
or too small or duplicative.

  <LI>Edit Me - New session idea that a participant or staff member
entered.  An idea entered by a brainstorm user that is non-offensive
should be moved to this status.  These are still rough and may well
have issues.  Still could be duplicates.

  <LI>Vetted - A real session that we would like to see happen.  At
this point the language should be fairly close to final in the
description. Spell checking and grammar checking should have happened.
It needs have publication status, a type, kid category, division and a
room set.  Please check the duration (defaults to 1 hour) and the
various things the session might need (like power, mirrors, etc.)
This is the minimal status that participants are allowed to sign up
for.  Avoid duplicates (however the list is still approximately 3
times what will actually run).

  <LI>Assigned - Session has participants assigned to it.

  <LI> Scheduled - Session is in the schedule (do not set this by hand
as the tool actually sets this for you when you schedule it in a
room!)  The language needs to match what you want to see
<b>published</b>.

</UL>
#+end_src
