Documentation/Setting_Up.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Local file setup</h2>
<div class="outline-text-2" id="text-3">
<p>
There are certain localisms you want to set up, outside the svn
tree. This is so (should you need to) if an upgrade to the code-base
is desired, it can be done, without writing over your
customizations.
</p>

<p>
To begin the process change to your web install location.  There you
should see a list of files, and you will add one called "Local".
When done your list of files should be:
These files you will have to create or modify.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> db_name.php</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Copy the example webpages/db_name_sample.php to Local/db_name.php
as a start, and then put in the values you decided upon before
starting the install process.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> FooterTemplate.html</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is where you will put your standard footer, that will be
below all the public pages, to customize the look and feel to
match your event's presentation.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> HeaderTemplate.html</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This is where you will put your standard header, that will be
above all the public pages, to customize the look and feel to
match your event's presentation.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Participant_Images</h3>
<div class="outline-text-3" id="text-3-4">
<p>
If you choose to have images of your participants with their
bios, make this directory, and any pictures that match the
badgename of the participant will be put next to the bios.
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Verbiage</h3>
<div class="outline-text-3" id="text-3-5">
<p>
If you wish to customize what is put forth to your participants,
many of the pages allow for customization.  The list of them will
grow as more are done.  Any information in these files will
replace the default text.  Some examples of these files are:
</p>
</div>
<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> BrainstormWelcome_0</h4>
<div class="outline-text-4" id="text-3-5-1">
<div class="org-src-container">

<pre class="src src-html">&lt;P&gt; Here you can submit new suggestions or look at existing ideas for
panels, Meet and Greets, Special Interest Groups, Birds Of a Feathers,
Author Readings, and Author Signings.&lt;/P&gt;
&lt;P&gt; As suggestions come in and we read through them, we will rework
them, combine similar ideas into a single item, split large ones into
pieces that will fit in their alloted time, etc.  Please expect the
suggestions you submit to evolve over time.&lt;/P&gt;
&lt;P&gt; Also, please note that we always have more suggestions than are
physically possible with the space and time we have, so not everything
will make it.  We do save good ideas for future conventions.&lt;/P&gt;
&lt;UL&gt;
  &lt;LI&gt; &lt;A HREF="BrainstormSearchSession.php"&gt;Search&lt;/A&gt; for similar
  ideas or get inspiration.
  &lt;LI&gt; Email &lt;A HREF="mailto:program@ourcon.org"&gt;
  program@ourcon.org&lt;/A&gt; to suggest modifications on existing
  suggestion.
  &lt;LI&gt; &lt;A HREF="BrainstormCreateSession.php"&gt;Enter a panel, MnG, SIG,
  BOF, et al suggestion.&lt;/A&gt;
  &lt;LI&gt; &lt;A HREF="BrainstormSuggestPresenter.php"&gt;Enter a suggestion for
  a Presenter.&lt;/A&gt;
  &lt;LI&gt; See the list of &lt;A HREF="BrainstormReportAll.php"&gt;All&lt;/A&gt;
  suggestions (we've seen some and not see others).
  &lt;LI&gt; See the list of &lt;A HREF="BrainstormReportUnseen.php"&gt;New&lt;/A&gt;
  suggestions that have been entered recently (may not be fit for
  young eyes, we haven't see these yet).
  &lt;LI&gt; See the list of &lt;A HREF="BrainstormReportReviewed.php"&gt;
  Reviewed&lt;/A&gt; suggestions we are currently working through.
  &lt;LI&gt; See the list of &lt;A HREF="BrainstormReportLikely.php"&gt;Likely to
  Occur&lt;/A&gt; suggestions we are or will allow participants to sign up
  for.
  &lt;LI&gt; See the list of &lt;A HREF="BrainstormReportScheduled.php"&gt;
  Scheduled&lt;/A&gt; suggestions.  These are very likely to happen at con.
  &lt;LI&gt; Email &lt;A HREF="mailto:vols@ourcon.org"&gt;vols@ourcon.org&lt;/A&gt; to
  volunteer to help process these ideas.
&lt;/UL&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Introduction_Blurb_0</h4>
<div class="outline-text-4" id="text-3-5-2">
<div class="org-src-container">

<pre class="src src-html">and before I introduce our speaker, let me ask, How many of you are
new?  Well, let me tell you, you are in for one heck of a ride.&lt;br
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Schedule_Blurb_0</h4>
<div class="outline-text-4" id="text-3-5-3">
<div class="org-src-container">

<pre class="src src-html">Welcome to the Circus Fantastique.  We really appreciate all your
efforts to make this weekend go so well.  Below is your schedule for
the weekend.  If you have any questions, please, do not hesitate to
find our staff in the Green Room, or whomever our point-person is at
that time.  &lt;/P&gt;&lt;P&gt;I hope you will have all the fun you can!&lt;hr&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> StaffPage_0</h4>
<div class="outline-text-4" id="text-3-5-4">
<div class="org-src-container">

<pre class="src src-html">&lt;P&gt; Please note the tabs above.  One of them will take you to your
participant view.  Another will allow you to manage Sessions.  Note
that Sessions is the generic term we are using for all Events,
Classes, Panels, BOF/SIG/MnG, other activities, etc. &lt;/P&gt;

&lt;P&gt;Current roles:
&lt;UL&gt;
  &lt;LI&gt;Pre-con Logistics: That tall guy, with the 'stash
  &lt;LI&gt;At-con Logistics: Bill(1)
  &lt;LI&gt;Speaker Liaison: Kat (with a "K")
  &lt;LI&gt;Assistant Speaker Liaison: Bill(2)
  &lt;LI&gt;Volunteer Captain: Cat
  &lt;LI&gt;Assistant Volunteer Captain: The Other Cat
  &lt;LI&gt;Green Room Czar: Tim
  &lt;LI&gt;Point People: Helium 1, Helium 2, and the Stupid But Cute.
  &lt;LI&gt;Schedule Wranglers: The group as a whole
  &lt;LI&gt;Technical support: Will
  &lt;LI&gt;(Tentative) Technical Support: Nyot
  &lt;LI&gt;Bio/copy editing: Rupert
&lt;/UL&gt;&lt;/P&gt;

&lt;P&gt;The general flow of sessions over time is: &lt;UL&gt; &lt;LI&gt;Brainstorm -
New session idea put in to the system by one of our brainstorm
users. The idea may or may not be sane or good.  It could be too big
or too small or duplicative.

  &lt;LI&gt;Edit Me - New session idea that a participant or staff member
entered.  An idea entered by a brainstorm user that is non-offensive
should be moved to this status.  These are still rough and may well
have issues.  Still could be duplicates.

  &lt;LI&gt;Vetted - A real session that we would like to see happen.  At
this point the language should be fairly close to final in the
description. Spell checking and grammar checking should have happened.
It needs have publication status, a type, kid category, division and a
room set.  Please check the duration (defaults to 1 hour) and the
various things the session might need (like power, mirrors, etc.)
This is the minimal status that participants are allowed to sign up
for.  Avoid duplicates (however the list is still approximately 3
times what will actually run).

  &lt;LI&gt;Assigned - Session has participants assigned to it.

  &lt;LI&gt; Scheduled - Session is in the schedule (do not set this by hand
as the tool actually sets this for you when you schedule it in a
room!)  The language needs to match what you want to see
&lt;b&gt;published&lt;/b&gt;.

&lt;/UL&gt;
</pre>
</div>
</div>
</div>
