Documentation/Source/Setting_Up.org
*** Volunteer_Jobs_0
#+begin_src html :exports both :results silent
<UL>
<H3>Introducer: (in room)</H3>
  <LI> Sign in at the Green Room, so we know everything is covered.
  <LI> Collect anything needful, like handouts and blank surveys, or
  if it is the first class of the day, the signs, from the Green Room.
  <LI> Be at class 10 minutes early (at the actual end of the previous
  class).
  <LI> You may, if you wish, pre-stage surveys on people's seats for
  when they arrive.
  <LI> At the beginning of class, move to the front of the room and do
  the introduction.  The Con Blurb and the speaker(s) bio(s) as
  provided.
  <UL>
    <LI>NOTE: A board member or member of the organizing team may step
    forward to do the introduction, in which case, please hand them
    the paper to do it off of.
  </UL>
  <LI> Take the head count of the class (twice) and write them in the
  spots provided on the introduction paper.
  <LI> Be in the back of the room during class so:
  <UL>
     <LI> When the Runner comes to check on the room, you can let them
     know if there is anything needed.
     <LI> If there is vending in the class, you might need to mind the
     table, while the presenter is presenting, if they don't already
     have someone assisting them.
     <LI> Using the signs provided, give the 10 minute, 5 minute, and
     Done warnings.
     <LI> Hand out/collect surveys and pencils at the end of class.
  </UL>
  <LI> Do the hand-off to the next Introducer, which includes the
  blank surveys and the signs.
  <LI> Return the filled out surveys collected folded in the class
  sheet, when you are checking in at the end of your stint.
<H3>Volunteer: (outside room)</H3>
  <LI> Check that people coming into the room have the correct
  wristbands.  If they do not, politely send them to registration (if
  it is open) to get them.  If there is an issue, notify the point
  person.
  <LI> Stay at the door during class to ensure that excessive ins and
  outs don't occur.
<H3>Runner: (all over con)</H3>
  <LI> Ensure that every class room has what it needs.
  <LI> Ensure that that A/V and supply needs of a class are met prior
  to it beginning.
  <LI> You can quietly and respectfully bring any supplies into the
  room as a class is going on, and make sure the Introducer knows what
  was delivered.
<H3>Green Room: (green room)</H3>
The green room is a space designated for Presenters, Programming
Volunteers, Panelists, and Assistants only.  While you are welcome to
hang out there, it is also the Programming Team's Ground Zero, so, you
might be pressed into service.
  <LI> Assist the Program Participants, including disseminating their
  packets as necessary.
  <LI> Check in and out the Introducers and Volunteers as they come on
  and off their stints.
  <LI> Make sure all necessary supplies are available for the
  volunteers as they arrive for check in, including any handouts.
  <LI> Be available to collect the surveys, etc as they arrive.
  <LI> Stay in the room and hang out with everyone!
  <LI> Be in contact with the Programming Point Person for any
  problem.
</UL>
#+end_src
*** Welcome_Letter_Presenters_0
#+begin_src html :exports both :results silent
<P>Dude!

<P>Thanks for helping us, man.  You really came through.  Like,
everyone learned bags of info, and your flow was rad!

<P>Every hand was good, yours were great!  High-five!

<P>Dude!

<P>The org-folk.
#+end_src
*** Welcome_Letter_Presenters_and_Volunteers_0
#+begin_src html :exports both :results silent
<P>We would like to express our gratitude for your contribution to the
Ancient Order of the Spies Convention.  Your expertise, wisdom,
experience, and willingness to share your knowledge are critical
elements in what will make our event a success.  We here at Opsidec do
all we can to create a safe and inviting environment for all
secretive/spying/hiding people, but we must also rely on support from
generous allies such as yourself.  Your time and effort are much
appreciated, and are a benefit to all in this lifestyle.

<P>You contribution is helping us to create an event in which any and
all people can learn and access information that they may not have
available to them in their general life.  This process is crucial to
expand knowledge and support throughout our cities and also throughout
the world.  You are assisting in constructing a safe and supportive
atmosphere that truly fosters our community.  Thank you again for your
participation in the Ancient Order of the Spies Convention.  Your
addition to this event is an advantage to all.

<P>With much gratitude,

<P>Opsidec Limited Organizers
#+end_src
*** Welcome_Letter_Volunteers_0
#+begin_src html :exports both :results silent
<P>We would like to express our gratitude for your contribution to the
Con of your Dreams.  Your willingness to share your time and energy
are critical elements in what will make our event a success.  We here
at Dream Productions do all we can to create a safe and inviting
environment for all sleapers, but we must also rely on support from
generous allies such as yourself.  Your effort is much appreciated,
and is a benefit to all in this lifestyle.

<P>You contribution is helping us to create an event in which any and
all people can learn and access information that they may not have
available to them in their general life.  This process is crucial to
expand knowledge and support throughout our cities and also throughout
the world.  You are assisting in constructing a safe and supportive
atmosphere that truly fosters our community.  Thank you again for your
participation in the Con of your Dreams.  Your addition to this event
is an advantage to all.

<P>With much gratitude,

<P>The Programming Team
#+end_src
* Database setup
  You should already have mysql set up.  If mysql is not already set
  up, a good guide to setting up a mysql server is:

#+LaTeX: \begin{small}
  http://www.linuxhomenetworking.com/wiki/index.php/Quick_HOWTO_:_Ch34_:_Basic_MySQL_Configuration
#+LaTeX: \end{small}

  The pieces of information you will need are from the above decisions
  for the db_name.php file:

  + database hostname: (*DBHOSTNAME*) (If you are setting things up on
    the same machine that MySQL is running on, /localhost/ should be
    what you are using for *DBHOSTNAME*).
  + database username: (*DBUSERNAME*)
  + database password: (*DBPASSOWRD*)
  + database name: (*DBNAME*)
  + Each of the alternate database locators that will be used:
    (*BIODB*), (*REPORTDB*), (*CONGODB*), (*LIMITDB*), (*LOCALDB*),
    (*TIMECARDDB*)
  + your host name (*MYHOST*) (If you are setting things up on the
    same machine that MySQL is running on, /localhost/ should be what
    you are using for *MYHOST*)
** Hosted server
  If you are going to have your database served from a machine that
  is running cpanel or some other menu-based software, the method of
  setting up your database should be documented there.

  The chances are your setup will have you:
  + create a database or databases
  + possibly create a MySQL user
  + add MySQL user to the database or databases
  + grant the MySQL user all privs.
