Documentation/Setting_Up.html

<div id="outline-container-sec-3-5-5" class="outline-4">
<h4 id="sec-3-5-5"><span class="section-number-4">3.5.5</span> Volunteer_Jobs_0</h4>
<div class="outline-text-4" id="text-3-5-5">
<div class="org-src-container">

<pre class="src src-html">&lt;UL&gt;
&lt;H3&gt;Introducer: (in room)&lt;/H3&gt;
  &lt;LI&gt; Sign in at the Green Room, so we know everything is covered.
  &lt;LI&gt; Collect anything needful, like handouts and blank surveys, or
  if it is the first class of the day, the signs, from the Green Room.
  &lt;LI&gt; Be at class 10 minutes early (at the actual end of the previous
  class).
  &lt;LI&gt; You may, if you wish, pre-stage surveys on people's seats for
  when they arrive.
  &lt;LI&gt; At the beginning of class, move to the front of the room and do
  the introduction.  The Con Blurb and the speaker(s) bio(s) as
  provided.
  &lt;UL&gt;
    &lt;LI&gt;NOTE: A board member or member of the organizing team may step
    forward to do the introduction, in which case, please hand them
    the paper to do it off of.
  &lt;/UL&gt;
  &lt;LI&gt; Take the head count of the class (twice) and write them in the
  spots provided on the introduction paper.
  &lt;LI&gt; Be in the back of the room during class so:
  &lt;UL&gt;
     &lt;LI&gt; When the Runner comes to check on the room, you can let them
     know if there is anything needed.
     &lt;LI&gt; If there is vending in the class, you might need to mind the
     table, while the presenter is presenting, if they don't already
     have someone assisting them.
     &lt;LI&gt; Using the signs provided, give the 10 minute, 5 minute, and
     Done warnings.
     &lt;LI&gt; Hand out/collect surveys and pencils at the end of class.
  &lt;/UL&gt;
  &lt;LI&gt; Do the hand-off to the next Introducer, which includes the
  blank surveys and the signs.
  &lt;LI&gt; Return the filled out surveys collected folded in the class
  sheet, when you are checking in at the end of your stint.
&lt;H3&gt;Volunteer: (outside room)&lt;/H3&gt;
  &lt;LI&gt; Check that people coming into the room have the correct
  wristbands.  If they do not, politely send them to registration (if
  it is open) to get them.  If there is an issue, notify the point
  person.
  &lt;LI&gt; Stay at the door during class to ensure that excessive ins and
  outs don't occur.
&lt;H3&gt;Runner: (all over con)&lt;/H3&gt;
  &lt;LI&gt; Ensure that every class room has what it needs.
  &lt;LI&gt; Ensure that that A/V and supply needs of a class are met prior
  to it beginning.
  &lt;LI&gt; You can quietly and respectfully bring any supplies into the
  room as a class is going on, and make sure the Introducer knows what
  was delivered.
&lt;H3&gt;Green Room: (green room)&lt;/H3&gt;
The green room is a space designated for Presenters, Programming
Volunteers, Panelists, and Assistants only.  While you are welcome to
hang out there, it is also the Programming Team's Ground Zero, so, you
might be pressed into service.
  &lt;LI&gt; Assist the Program Participants, including disseminating their
  packets as necessary.
  &lt;LI&gt; Check in and out the Introducers and Volunteers as they come on
  and off their stints.
  &lt;LI&gt; Make sure all necessary supplies are available for the
  volunteers as they arrive for check in, including any handouts.
  &lt;LI&gt; Be available to collect the surveys, etc as they arrive.
  &lt;LI&gt; Stay in the room and hang out with everyone!
  &lt;LI&gt; Be in contact with the Programming Point Person for any
  problem.
&lt;/UL&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-6" class="outline-4">
<h4 id="sec-3-5-6"><span class="section-number-4">3.5.6</span> Welcome_Letter_Presenters_0</h4>
<div class="outline-text-4" id="text-3-5-6">
<div class="org-src-container">

<pre class="src src-html">&lt;P&gt;Dude!

&lt;P&gt;Thanks for helping us, man.  You really came through.  Like,
everyone learned bags of info, and your flow was rad!

&lt;P&gt;Every hand was good, yours were great!  High-five!

&lt;P&gt;Dude!

&lt;P&gt;The org-folk.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-7" class="outline-4">
<h4 id="sec-3-5-7"><span class="section-number-4">3.5.7</span> Welcome_Letter_Presenters_and_Volunteers_0</h4>
<div class="outline-text-4" id="text-3-5-7">
<div class="org-src-container">

<pre class="src src-html">&lt;P&gt;We would like to express our gratitude for your contribution to the
Ancient Order of the Spies Convention.  Your expertise, wisdom,
experience, and willingness to share your knowledge are critical
elements in what will make our event a success.  We here at Opsidec do
all we can to create a safe and inviting environment for all
secretive/spying/hiding people, but we must also rely on support from
generous allies such as yourself.  Your time and effort are much
appreciated, and are a benefit to all in this lifestyle.

&lt;P&gt;You contribution is helping us to create an event in which any and
all people can learn and access information that they may not have
available to them in their general life.  This process is crucial to
expand knowledge and support throughout our cities and also throughout
the world.  You are assisting in constructing a safe and supportive
atmosphere that truly fosters our community.  Thank you again for your
participation in the Ancient Order of the Spies Convention.  Your
addition to this event is an advantage to all.

&lt;P&gt;With much gratitude,

&lt;P&gt;Opsidec Limited Organizers
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-8" class="outline-4">
<h4 id="sec-3-5-8"><span class="section-number-4">3.5.8</span> Welcome_Letter_Volunteers_0</h4>
<div class="outline-text-4" id="text-3-5-8">
<div class="org-src-container">

<pre class="src src-html">&lt;P&gt;We would like to express our gratitude for your contribution to the
Con of your Dreams.  Your willingness to share your time and energy
are critical elements in what will make our event a success.  We here
at Dream Productions do all we can to create a safe and inviting
environment for all sleapers, but we must also rely on support from
generous allies such as yourself.  Your effort is much appreciated,
and is a benefit to all in this lifestyle.

&lt;P&gt;You contribution is helping us to create an event in which any and
all people can learn and access information that they may not have
available to them in their general life.  This process is crucial to
expand knowledge and support throughout our cities and also throughout
the world.  You are assisting in constructing a safe and supportive
atmosphere that truly fosters our community.  Thank you again for your
participation in the Con of your Dreams.  Your addition to this event
is an advantage to all.

&lt;P&gt;With much gratitude,

&lt;P&gt;The Programming Team
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Database setup</h2>
<div class="outline-text-2" id="text-4">
<p>
You should already have mysql set up.  If mysql is not already set
up, a good guide to setting up a mysql server is:
</p>

<p>
<a href="http://www.linuxhomenetworking.com/wiki/index.php/Quick_HOWTO_:_Ch34_:_Basic_MySQL_Configuration">http://www.linuxhomenetworking.com/wiki/index.php/Quick_HOWTO_:_Ch34_:_Basic_MySQL_Configuration</a>
</p>
<p>
The pieces of information you will need are from the above decisions
for the db_name.php file:
</p>

<ul class="org-ul">
<li>database hostname: (<b>DBHOSTNAME</b>) (If you are setting things up on
the same machine that MySQL is running on, <i>localhost</i> should be
what you are using for <b>DBHOSTNAME</b>).
</li>
<li>database username: (<b>DBUSERNAME</b>)
</li>
<li>database password: (<b>DBPASSOWRD</b>)
</li>
<li>database name: (<b>DBNAME</b>)
</li>
<li>Each of the alternate database locators that will be used:
(<b>BIODB</b>), (<b>REPORTDB</b>), (<b>CONGODB</b>), (<b>LIMITDB</b>), (<b>LOCALDB</b>),
(<b>TIMECARDDB</b>)
</li>
<li>your host name (<b>MYHOST</b>) (If you are setting things up on the
same machine that MySQL is running on, <i>localhost</i> should be what
you are using for <b>MYHOST</b>)
</li>
</ul>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Hosted server</h3>
<div class="outline-text-3" id="text-4-1">
<p>
If you are going to have your database served from a machine that
is running cpanel or some other menu-based software, the method of
setting up your database should be documented there.
</p>

<p>
The chances are your setup will have you:
</p>
<ul class="org-ul">
<li>create a database or databases
</li>
<li>possibly create a MySQL user
</li>
<li>add MySQL user to the database or databases
</li>
<li>grant the MySQL user all privs.
</li>
</ul>
</div>
</div>
