Documentation/Source/Setting_Up.org
** Your own MySQL Setup
   If you are setting up your own MySQL server, and need to set up the
   database by hand the following steps should work for you.  Don't
   forget to replace the instances of *DBHOSTNAME*, *DBUSERNAME*,
   etc. with the proper bits of information.

   + Log into the database: (it should ask you for your MySQL root password)
#+begin_src html :exports both :results silent
   mysql -h*DBHOSTNAME* -p -u root
#+end_src
   + Create your database:
#+begin_src html :exports both :results silent
   create database DBNAME;
#+end_src
   + Grant *DBUSERNAME* user access with the password of *DBPASSWORD*:
#+begin_src html :exports both :results silent
   grant all on DBNAME.* to 'DBUSERNAME'@'MYHOST' identified by 'DBPASSOWRD';
   grant lock tables on DBNAME.* to 'DBUSERNAME'@'MYHOST';
#+end_src
   + Reset the privilages
#+begin_src html :exports both :results silent
   flush privileges;
#+end_src
* Database populate
  change directories until you are in the Install directory, then:
#+begin_src html :exports both :results silent
    mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME < ./EmptyDbase.dump
#+end_src
* Database tweaks
  Some of the tables in the database don't yet have appropriate
  front-ends, so, to customize them for your particular event, you
  will need to modify them directly from the MySQL client.  As
  development proceeds, these will get fewer over time.

  Currently, they are:
  + Divisions:: If you want some other divisions than Other,
    Programming, Events, Fixed Functions, Hotel, Unspecified, and
    Volunteer.
  + EmailCC:: Needs to be customized for your convention.
  + EmailFrom:: Needs to be customized for your convention.
  + EmailTo:: Might need to be customized.
  + Features:: List of things that can be in a room.  Might need to be
    customized.
  + Phases:: The "Phase" you are in will need to be changed as your
    phase changes.
  + PreconHours:: If you are tracking volunteer hours, the PreconHours
    will probably need to be added to.
  + PubStatuses:: Depending on the useage of the software, you might
    need more statuses than Prog Staff, Public, Do Not Print, and
    Volunteer.
  + QuestionsForSurvey:: You might want to change these.
  + RegTypes:: Depending on how you use it, the RegTypes may change.
  + Roles:: Fairly standard, but might want to be customized for your
    convention.
  + RoomSets: Fairly standard, but might want to be customized for
    your convention.
  + Rooms:: This definitely wants to be customized for your
    convention.
  + Services:: List of services that can be provided to a room.  Might
    need to be customized.
  + SessionStatuses:: Might need to be customized for your
    convention.
  + Tracks:: Probably will want to be customized for your convention
  + Types:: May want to be customized for your convention.

  Also, some of the Permission interconnects might have to be
  customized for your convention.

  One set of tables that you might be updating across the life of this
  instance of Zambia is the Reports table.  As people generate useful
  reports, they do tend to get shared.  We hope that, should you
  develop noteworthy reports, you share them back with the community
  at large, as well.

  Loading such reports are often as simple as:
#+begin_src html :exports both :results silent
    mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME < ./NewReports.sql
#+end_src

  Sharing them is as simple as, say, exporting your new report called
  /voltimepanelists/:
#+begin_src html :exports both :results silent
    echo "SELECT * FROM Reports WHERE reportname='voltimepanelists';" |
    mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME > ./NewReports.sql
#+end_src

* Account creation
** Standalone
   If you are going to be using Zambia and not some other registration
   package, you are going to need access to the program, to begin
   adding the people who are going to be working with the system.

   Currently the easiest way to do so is to add the first three users,
   by pulling in the Initial_Users.sql file from the /Install/
   directory.

#+begin_src html :exports both :results silent
    mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME < ./Inital_Users.sql
#+end_src

   Once you have done that, you can log in to Zambia using the badgeid
   of *101* and the password of *changeme*.

   You then can modify the appropriate information.  Under the /Manage
   Participants & Schedule/ tab, there is an /Administer Participants/
   choice.  Selecting that will allow you to update your password
   (_important step_) and the "Edit Further" link at the bottom of
   the page will allow you to update the information so it actually
   matches you.

   Feel free to then go and add the rest of your staff, off of the
   /Enter Participants/ link.
** Congo
   You might want to complete the activites above, just to make sure
   you have access, but once you do, you can migrate the congo data
   into the system, so all the other folks have their information
   added.

   From congo, do:
#+begin_src html :exports both :results silent
    export_program_participants_congo.sql
#+end_src

   This generates sql that can be, in turn, locaded into Zambia.

** Not Congo
   Tying this into another registration system is slightly more
   complicated.  The easiest way is to use the "regtype" field to
   track the registration number that the various other registration
   programs give you, and see if there is a way to massage their data
   into the "CongoDump" format.
* First steps
** Schedule
   Establishing the schedule of activities in the form of a "todo"
   list is probably the first thing you wish to do.

#+begin_src html :exports both :results silent
     YourWebPath/webpages/genreport.php?reportname=tasklistdisplay
#+end_src

   Replacing, of course /YourWebPath/ with the proper URL to get to
   your Zambia-FFF branch install.
** Brainstorming
   The Brainstorming links should work immediately.  From the top
   directory (index) page of your site, you should be able to click on
   the "Suggest a Session/Presenter" button and get right into it.
* Backing up
  Under the /scripts/ directory there is a nice little shell-script
  that you can call with cron to back your information up.  If you are
  to use it, make sure you create the /Data_Backup/ directory under
  the /Local/ directory before you use it.  I back up weekly several
  months before the con, start in on daily once heavy changes are
  being made, so we loose less information if there is a problem, and
  then about a month or so after the con, back off to weekly or
  monthly.  At one point in time, I was running it hourly, just to be
  sure.

  The script is invoked as:
#+begin_src html :exports both :results silent
  backup_mysql /your/path/to/Zambia-FFF/instance
#+end_src
