Documentation/Setting_Up.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Your own MySQL Setup</h3>
<div class="outline-text-3" id="text-4-2">
<p>
If you are setting up your own MySQL server, and need to set up the
database by hand the following steps should work for you.  Don't
forget to replace the instances of <b>DBHOSTNAME</b>, <b>DBUSERNAME</b>,
etc. with the proper bits of information.
</p>

<ul class="org-ul">
<li>Log into the database: (it should ask you for your MySQL root password)
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">mysql -h*DBHOSTNAME* -p -u root
</pre>
</div>
<ul class="org-ul">
<li>Create your database:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">create database DBNAME;
</pre>
</div>
<ul class="org-ul">
<li>Grant <b>DBUSERNAME</b> user access with the password of <b>DBPASSWORD</b>:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">grant all on DBNAME.* to 'DBUSERNAME'@'MYHOST' identified by 'DBPASSOWRD';
grant lock tables on DBNAME.* to 'DBUSERNAME'@'MYHOST';
</pre>
</div>
<ul class="org-ul">
<li>Reset the privilages
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">flush privileges;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Database populate</h2>
<div class="outline-text-2" id="text-5">
<p>
change directories until you are in the Install directory, then:
</p>
<div class="org-src-container">

<pre class="src src-html">mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME &lt; ./EmptyDbase.dump
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Database tweaks</h2>
<div class="outline-text-2" id="text-6">
<p>
Some of the tables in the database don't yet have appropriate
front-ends, so, to customize them for your particular event, you
will need to modify them directly from the MySQL client.  As
development proceeds, these will get fewer over time.
</p>

<p>
Currently, they are:
</p>
<ul class="org-ul">
<li>Divisions:: If you want some other divisions than Other,
Programming, Events, Fixed Functions, Hotel, Unspecified, and
Volunteer.
</li>
<li>EmailCC:: Needs to be customized for your convention.
</li>
<li>EmailFrom:: Needs to be customized for your convention.
</li>
<li>EmailTo:: Might need to be customized.
</li>
<li>Features:: List of things that can be in a room.  Might need to be
customized.
</li>
<li>Phases:: The "Phase" you are in will need to be changed as your
phase changes.
</li>
<li>PreconHours:: If you are tracking volunteer hours, the PreconHours
will probably need to be added to.
</li>
<li>PubStatuses:: Depending on the useage of the software, you might
need more statuses than Prog Staff, Public, Do Not Print, and
Volunteer.
</li>
<li>QuestionsForSurvey:: You might want to change these.
</li>
<li>RegTypes:: Depending on how you use it, the RegTypes may change.
</li>
<li>Roles:: Fairly standard, but might want to be customized for your
convention.
</li>
<li>RoomSets: Fairly standard, but might want to be customized for
your convention.
</li>
<li>Rooms:: This definitely wants to be customized for your
convention.
</li>
<li>Services:: List of services that can be provided to a room.  Might
need to be customized.
</li>
<li>SessionStatuses:: Might need to be customized for your
convention.
</li>
<li>Tracks:: Probably will want to be customized for your convention
</li>
<li>Types:: May want to be customized for your convention.
</li>
</ul>

<p>
Also, some of the Permission interconnects might have to be
customized for your convention.
</p>

<p>
One set of tables that you might be updating across the life of this
instance of Zambia is the Reports table.  As people generate useful
reports, they do tend to get shared.  We hope that, should you
develop noteworthy reports, you share them back with the community
at large, as well.
</p>

<p>
Loading such reports are often as simple as:
</p>
<div class="org-src-container">

<pre class="src src-html">mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME &lt; ./NewReports.sql
</pre>
</div>

<p>
Sharing them is as simple as, say, exporting your new report called
<i>voltimepanelists</i>:
</p>
<div class="org-src-container">

<pre class="src src-html">echo "SELECT * FROM Reports WHERE reportname='voltimepanelists';" |
mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME &gt; ./NewReports.sql
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Account creation</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Standalone</h3>
<div class="outline-text-3" id="text-7-1">
<p>
If you are going to be using Zambia and not some other registration
package, you are going to need access to the program, to begin
adding the people who are going to be working with the system.
</p>

<p>
Currently the easiest way to do so is to add the first three users,
by pulling in the Initial_Users.sql file from the <i>Install</i>
directory.
</p>

<div class="org-src-container">

<pre class="src src-html">mysql -hDBHOSTNAME -p -uDBUSERNAME DBNAME &lt; ./Inital_Users.sql
</pre>
</div>

<p>
Once you have done that, you can log in to Zambia using the badgeid
of <b>101</b> and the password of <b>changeme</b>.
</p>

<p>
You then can modify the appropriate information.  Under the <i>Manage
Participants &amp; Schedule</i> tab, there is an <i>Administer Participants</i>
choice.  Selecting that will allow you to update your password
(_important step_) and the "Edit Further" link at the bottom of
the page will allow you to update the information so it actually
matches you.
</p>

<p>
Feel free to then go and add the rest of your staff, off of the
<i>Enter Participants</i> link.
</p>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Congo</h3>
<div class="outline-text-3" id="text-7-2">
<p>
You might want to complete the activites above, just to make sure
you have access, but once you do, you can migrate the congo data
into the system, so all the other folks have their information
added.
</p>

<p>
From congo, do:
</p>
<div class="org-src-container">

<pre class="src src-html">export_program_participants_congo.sql
</pre>
</div>

<p>
This generates sql that can be, in turn, locaded into Zambia.
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Not Congo</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Tying this into another registration system is slightly more
complicated.  The easiest way is to use the "regtype" field to
track the registration number that the various other registration
programs give you, and see if there is a way to massage their data
into the "CongoDump" format.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> First steps</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Schedule</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Establishing the schedule of activities in the form of a "todo"
list is probably the first thing you wish to do.
</p>

<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/genreport.php?reportname=tasklistdisplay
</pre>
</div>

<p>
Replacing, of course <i>YourWebPath</i> with the proper URL to get to
your Zambia-FFF branch install.
</p>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Brainstorming</h3>
<div class="outline-text-3" id="text-8-2">
<p>
The Brainstorming links should work immediately.  From the top
directory (index) page of your site, you should be able to click on
the "Suggest a Session/Presenter" button and get right into it.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Backing up</h2>
<div class="outline-text-2" id="text-9">
<p>
Under the <i>scripts</i> directory there is a nice little shell-script
that you can call with cron to back your information up.  If you are
to use it, make sure you create the <i>Data_Backup</i> directory under
the <i>Local</i> directory before you use it.  I back up weekly several
months before the con, start in on daily once heavy changes are
being made, so we loose less information if there is a problem, and
then about a month or so after the con, back off to weekly or
monthly.  At one point in time, I was running it hourly, just to be
sure.
</p>

<p>
The script is invoked as:
</p>
<div class="org-src-container">

<pre class="src src-html">backup_mysql /your/path/to/Zambia-FFF/instance
</pre>
</div>
</div>
</div>
