Documentation/Source/Setting_Up.org
* Quick and dirty
  To build a quick and dirty copy on the same machine as another running version:
  + for i in ../Zambia-FFF/* ; do ln -s $i . ; done
  + rm Local
  + rm webpages
  + mkdir Local webpages
  + cd webpages
  + for i in ../../Zambia-FFF/webpages/* ; do ln -s $i . ; done
  + cd ../Local
  + mkdir Verbiage
  + for i in ../../Zambia-FFF/Local/*.html ; do ln -s $i . ; done
  + ln -s ../../Zambia-FFF/Local/Participant_Images .
  Finally, copy over, and modify the db_name.php as appropraite
  To update them all do:
#+begin_src html :exports both :results silent
for i in FFF-[34]*
  do
    pushd $i/webpages
    for j in ../../Zambia-FFF/webpages/*
      do
        ln -s $j .
      done
    popd
  done
#+end_src
* Adding a year instance - Con Structure
  Another Con instance is approaching.  To set up for this, there is
  one file and a number of table additions you need to make.  At some
  point the table additions might have their own form.  Feel free to
  update them any way you are comfortable with at the moment.  The
  update to the Local/db_name.php file should only be the update to
  the CON_KEY entry in the file, all the rest should remain the same,
  and probably that should migrate to something database setable at
  some point.  The rest of the information below should be set in your
  database tables.
** ConInfo
   The first place to start is setting your ConInfo information.  This
   allows for the con to show up in the index file, and opens all the
   information up for access, addition, and whatever else you want for
   your con.  If you wish to see what values were set for a previous
   instance of your con (to make sure you have the right values), you
   might want to use a query (replacing the $conid with the previous
   con you want to model on) like:
#+begin_src html :exports both :results silent
    SELECT
        *
      FROM
          ConInfo
      WHERE
        conid=$conid;
#+end_src
   The values are:
   + conid: The unique number of your con.
   + conname: The name of your con (probably inclucign either the
     number, or the year of your con or other unique identifier).
   + connumdays: How many days your con will run.
   + constartdate: When your con begins, in the format of YYYY-MM-DD
     hh:mm:ss and preferably (for ease of thought and scheduling)
     having your hh:mm:ss be 00:00:00 or midnight.
   + conurl: This should be the head of your tree, and match all the
     previous conurls for this con.
   + conlogo: This should point to the logo of your con.  If you do
     not modify it event-to-event, it will probably be the same as the
     previous conlogos for this con.
   + condefaultduration: This is the default session length in hh:mm
     format.
   + condurationminutes: This is an enum set to either 'TRUE' or
     'FALSE' (yes, this is somewhat misleading, and probably should be
     changed to something else, globally).  If it is set to 'TRUE'
     then all times will be reported as just minutes.  If it is set to
     'FALSE' then all times will be in hh:mm notation where
     appropriate.
   + congridspacer: The default spacer value for the grid, in seconds.
     This should probably have several entries, in case the grid wants
     to be different, for different departments, but that is an
     enhancement, to come.
   + conallowkids: This is an enum set to either 'TRUE' or 'FALSE'
     (yes, this is somewhat misleading, and probably should be changed
     to something else, globally).  If it is set to 'TRUE' it allows
     for children, and special children programming.  If it is set to
     'FALSE' the special children programming will not appear.
   + contotalsess: The maximum number of total sessions you will allow
     your various people to sign up for.  This can vary due to the
     length of the session, how many days your con will run, etc.
   + condailysess: The maximum number of sessions on a particular day
     you will allow your various people to sign up for.  This can vary
     due to the length of the session, how many days your con will
     run, how many sessions there are in a day, and how hard you are
     willing to work them.
   + conavailabilityrows: How many rows of on/off times your people
     can put in, for their availability.  The longer the con, or the
     shorter the session, the more rows you want to allow them to
     have.
** Phase
   This also has to be set up so the appropriate Phase shifting can
   happen.  The phase of the convention will shift, over time, as
   deadlines approach and pass.  Not all of the phasetypeids from the
   PhaseTypes table need to be there, but, it is easier if they are,
   so all you have to do is change the phasestate, using the
   AdminPhases.php page and the appropriate phase changes state.  If
   you wish to see what values were set for a previous instance of
   your con (to make sure you have the right values), you might want
   to use a query (replacing the $conid with the previous con you want
   to model on) like:
#+begin_src html :exports both :results silent
    SELECT
        *
      FROM
          Phase
        JOIN PhaseTypes USING (phasetypeid)
      WHERE
        conid=$conid;
#+end_src
   The values are:
   + phaseid: the unique key for this entry
   + conid: The con that these phases are for.  This should be set to
     whatever conid you are creating.
   + phasetypeid: This is the phase that is being turned on or off, as
     described in the PhaseTypes table.
   + phasestate: If a phase is active.

   You might wish to simply populate your phases with (replacing
   $conid with the appropriate conid, and the last "," with ";"):
   INSERT INTO Phase (conid, phasetypeid, phasestate) VALUES
#+begin_src html :exports both :results silent
    SELECT
        concat("($conid,",phasetypeid,",0),") AS ValueSet
      FROM
          PhaseTypes;
#+end_src

   An example of phase shifting, is when you open your call for
   presenters, or you close your call for vendors, or you allow
   feedback.  This can change programatically on specific dates around
   your con, or you can set them by hand, when you are ready for a
   phase shift.  Many phases (or few) might be active at any given
   point in time.
* Adding a year instance - People
