Documentation/Setting_Up.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Quick and dirty</h2>
<div class="outline-text-2" id="text-10">
<p>
To build a quick and dirty copy on the same machine as another running version:
</p>
<ul class="org-ul">
<li>for i in ../Zambia-FFF/* ; do ln -s $i . ; done
</li>
<li>rm Local
</li>
<li>rm webpages
</li>
<li>mkdir Local webpages
</li>
<li>cd webpages
</li>
<li>for i in ../../Zambia-FFF/webpages/* ; do ln -s $i . ; done
</li>
<li>cd ../Local
</li>
<li>mkdir Verbiage
</li>
<li>for i in ../../Zambia-FFF/Local/*.html ; do ln -s $i . ; done
</li>
<li>ln -s ../../Zambia-FFF/Local/Participant_Images .
</li>
</ul>
<p>
Finally, copy over, and modify the db_name.php as appropraite
To update them all do:
</p>
<div class="org-src-container">

<pre class="src src-html">for i in FFF-[34]*
  do
    pushd $i/webpages
    for j in ../../Zambia-FFF/webpages/*
      do
	ln -s $j .
      done
    popd
  done
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Adding a year instance - Con Structure</h2>
<div class="outline-text-2" id="text-11">
<p>
Another Con instance is approaching.  To set up for this, there is
one file and a number of table additions you need to make.  At some
point the table additions might have their own form.  Feel free to
update them any way you are comfortable with at the moment.  The
update to the Local/db_name.php file should only be the update to
the CON_KEY entry in the file, all the rest should remain the same,
and probably that should migrate to something database setable at
some point.  The rest of the information below should be set in your
database tables.
</p>
</div>
<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> ConInfo</h3>
<div class="outline-text-3" id="text-11-1">
<p>
The first place to start is setting your ConInfo information.  This
allows for the con to show up in the index file, and opens all the
information up for access, addition, and whatever else you want for
your con.  If you wish to see what values were set for a previous
instance of your con (to make sure you have the right values), you
might want to use a query (replacing the $conid with the previous
con you want to model on) like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    *
  FROM
      ConInfo
  WHERE
    conid=$conid;
</pre>
</div>
<p>
The values are:
</p>
<ul class="org-ul">
<li>conid: The unique number of your con.
</li>
<li>conname: The name of your con (probably inclucign either the
number, or the year of your con or other unique identifier).
</li>
<li>connumdays: How many days your con will run.
</li>
<li>constartdate: When your con begins, in the format of YYYY-MM-DD
hh:mm:ss and preferably (for ease of thought and scheduling)
having your hh:mm:ss be 00:00:00 or midnight.
</li>
<li>conurl: This should be the head of your tree, and match all the
previous conurls for this con.
</li>
<li>conlogo: This should point to the logo of your con.  If you do
not modify it event-to-event, it will probably be the same as the
previous conlogos for this con.
</li>
<li>condefaultduration: This is the default session length in hh:mm
format.
</li>
<li>condurationminutes: This is an enum set to either 'TRUE' or
'FALSE' (yes, this is somewhat misleading, and probably should be
changed to something else, globally).  If it is set to 'TRUE'
then all times will be reported as just minutes.  If it is set to
'FALSE' then all times will be in hh:mm notation where
appropriate.
</li>
<li>congridspacer: The default spacer value for the grid, in seconds.
This should probably have several entries, in case the grid wants
to be different, for different departments, but that is an
enhancement, to come.
</li>
<li>conallowkids: This is an enum set to either 'TRUE' or 'FALSE'
(yes, this is somewhat misleading, and probably should be changed
to something else, globally).  If it is set to 'TRUE' it allows
for children, and special children programming.  If it is set to
'FALSE' the special children programming will not appear.
</li>
<li>contotalsess: The maximum number of total sessions you will allow
your various people to sign up for.  This can vary due to the
length of the session, how many days your con will run, etc.
</li>
<li>condailysess: The maximum number of sessions on a particular day
you will allow your various people to sign up for.  This can vary
due to the length of the session, how many days your con will
run, how many sessions there are in a day, and how hard you are
willing to work them.
</li>
<li>conavailabilityrows: How many rows of on/off times your people
can put in, for their availability.  The longer the con, or the
shorter the session, the more rows you want to allow them to
have.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Phase</h3>
<div class="outline-text-3" id="text-11-2">
<p>
This also has to be set up so the appropriate Phase shifting can
happen.  The phase of the convention will shift, over time, as
deadlines approach and pass.  Not all of the phasetypeids from the
PhaseTypes table need to be there, but, it is easier if they are,
so all you have to do is change the phasestate, using the
AdminPhases.php page and the appropriate phase changes state.  If
you wish to see what values were set for a previous instance of
your con (to make sure you have the right values), you might want
to use a query (replacing the $conid with the previous con you want
to model on) like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    *
  FROM
      Phase
    JOIN PhaseTypes USING (phasetypeid)
  WHERE
    conid=$conid;
</pre>
</div>
<p>
The values are:
</p>
<ul class="org-ul">
<li>phaseid: the unique key for this entry
</li>
<li>conid: The con that these phases are for.  This should be set to
whatever conid you are creating.
</li>
<li>phasetypeid: This is the phase that is being turned on or off, as
described in the PhaseTypes table.
</li>
<li>phasestate: If a phase is active.
</li>
</ul>

<p>
You might wish to simply populate your phases with (replacing
$conid with the appropriate conid, and the last "," with ";"):
INSERT INTO Phase (conid, phasetypeid, phasestate) VALUES
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat("($conid,",phasetypeid,",0),") AS ValueSet
  FROM
      PhaseTypes;
</pre>
</div>

<p>
An example of phase shifting, is when you open your call for
presenters, or you close your call for vendors, or you allow
feedback.  This can change programatically on specific dates around
your con, or you can set them by hand, when you are ready for a
phase shift.  Many phases (or few) might be active at any given
point in time.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Adding a year instance - People</h2>
