Documentation/Source/Setting_Up.org
** UserHasPermissionRole
   This need to be set so people can actually log into your con.  This
   defines the access any particular individual might have.
   Individuals might have several sets of accesses, depending on their
   roles, some cover more than one area, others do not.  This gets
   somewhat complex, in the interweaving of some other tables, but,
   theoretcially that was set up, and still should hold true from
   previous instances of your con.  Of course, tweaking from year to
   year might need to happen.  If you wish to see who had which
   leadership roles in a previous instance of your con (to make sure
   you are rolling forward with the right roles), you might want to
   use a query (replacing the $conid with the previous con you want to
   model on) like:
#+begin_src html :exports both :results silent
    SELECT
        concat(badgeid," - ",pubsname) as Who,
        concat(permroleid," - ",permrolename) as What
      FROM
          UserHasPermissionRole
        JOIN PermissionRoles USING (permroleid)
        JOIN Participants USING (badgeid)
      WHERE
        conid=$conid AND
        permrolename like "%Super%";
#+end_src
   This will give you the badgeids and the permroleids to add to the
   table.  It is in the format of:
   + badgeid: The unique id of an individual in Zambia.
   + permroleid: One of the set of permissions that an individual will
     have for this con.
   + conid: The con that these permission are for.  This should be set
     to whatever conid you are creating.

   If you want to only add your particular badgeid, permroleid, conid
   information, and then use the "Migrate Participant from another
   con-instance" link under the "Manage Participants & Schedule" tab 
   to give each the right permissions, that will work as well.  But at
   least you will need to be set up, so you can grant other people
   access.  The use of that page is well documented in the
   Presenter_Flow document in this directory.

   You probably also want to add the 100-user (the Brainstorm User
   called Idea Submissions), to permroleid 4 (Brainstorm) so that the
   brainstorm submission system will work.
** UserHasConRole
   This is very similar to the UserHasPermissionRole, and was split
   off, because not all Permission Roles want to necessarily be
   advertized, and sometimes a Permission Role is a superset of a Con
   Role that actually wants to be called out.  While this is not a
   necessary step, it is a good one to follow, so people know who is
   responsible for what, when they visit your webpage. If you wish to
   see who had which leadership roles in a previous instance of your
   con (to make sure you are rolling forward with the right roles),
   you might want to use a query (replacing the $conid with the
   previous con you want to model on) like:
#+begin_src html :exports both :results silent
    SELECT
        concat(badgeid," - ",pubsname) AS Who,
        concat(conroleid," - ",conrolename) AS What
      FROM
          UserHasConRole
        JOIN Participants USING (badgeid)
        JOIN ConRoles USING (conroleid)
      WHERE
        conid=$conid;
#+end_src
   This will give you the badgeids and conroleids to add to the
   table.  It is in the format of:
   + badgeid: The unique id of an individual in Zambia.
   + conroleid: A role that an individual will have for this con.
   + conid: The con that the role is for.  This should be set to
     whatever conid you are creating.

   You can always go back and add to this, as the shape of your con
   fills in.

   If you want to only add your particular badgeid, permroleid, conid
   information, and then use the "Migrate Participant from another
   con-instance" link under the "Manage Participants & Schedule" tab 
   to give each the right permissions, that will work as well.  But at
   least you will need to be set up, so you can grant other people
   access.  The use of that page is well documented in the
   Presenter_Flow document in this directory.

   You probably want to add the 100-user (the Brainstorm User called
   Idea Submissions), to conroleid 47 (BrainstormCoord) for tracking
   purposes.
** HasReports
   This maps the organizational chart of your convention.  Again while
   this is not a necessary step for the start of your con, and might
   be added to as your con goes on using the AdminHasReports.php page,
   usually you know what the table of your organization will be, even
   if you don't yet know who will be filling those roles.  To see what
   was before you can use a query (replacing the $conid with the
   previous con you want to model on) like:
#+begin_src html :exports both :results silent
    SELECT
        concat(HR.conroleid," - ",CR.conrolename) AS Role,
        concat(hasreport," - ",CRR.conrolename) AS Report
      FROM
          HasReports HR
        JOIN ConRoles CR USING (conroleid)
        JOIN ConRoles CRR ON (hasreport=CRR.conroleid)
      WHERE
        conid=$conid;
#+end_src
   This will give you the list of conroleids who have conroleids
   reporting to them.  You can add them to the table as:
   + conid: The con that these reports are for.  This should be set
     to whatever conid you are creating.
   + conroleid: This is the role that has others reporting to them
   + hasreport: The conroleid of the position that reports to the
     specified original conroleid.

   On the other hand, if you just want to mirror them, quickly, from
   another instance of your con you could always (replacing $origconid
   with the previous con you want to model on, and $conid with the
   current one) run:
#+begin_src html :exports both :results silent
    SELECT
        concat("($conid,",conroleid,",",hasreport,"),") AS Prev
      FROM
          HasReports
      WHERE
        conid=$origconid;
#+end_src
   Then just massage the data slightly, and you have the insert you
   can do to mirror the previous con.

   You probably want to make sure the BrainstormCoordinator (47),
   reports to Programming (3).
* Adding a year instance - Sessions
  The sessions are mostly generated from Brainstorm (and other
  insertions to your database) but there are a few settings that
  should be taken care of, to make sure everything works smoothly.
  The limits are set on an event basis, since sometimes publications
  or the space for things to be advertized differs from year to year.
  Also the requestables might change, depending on what is available,
  as well as the rooms
