Documentation/Setting_Up.html
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> UserHasPermissionRole</h3>
<div class="outline-text-3" id="text-12-1">
<p>
This need to be set so people can actually log into your con.  This
defines the access any particular individual might have.
Individuals might have several sets of accesses, depending on their
roles, some cover more than one area, others do not.  This gets
somewhat complex, in the interweaving of some other tables, but,
theoretcially that was set up, and still should hold true from
previous instances of your con.  Of course, tweaking from year to
year might need to happen.  If you wish to see who had which
leadership roles in a previous instance of your con (to make sure
you are rolling forward with the right roles), you might want to
use a query (replacing the $conid with the previous con you want to
model on) like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat(badgeid," - ",pubsname) as Who,
    concat(permroleid," - ",permrolename) as What
  FROM
      UserHasPermissionRole
    JOIN PermissionRoles USING (permroleid)
    JOIN Participants USING (badgeid)
  WHERE
    conid=$conid AND
    permrolename like "%Super%";
</pre>
</div>
<p>
This will give you the badgeids and the permroleids to add to the
table.  It is in the format of:
</p>
<ul class="org-ul">
<li>badgeid: The unique id of an individual in Zambia.
</li>
<li>permroleid: One of the set of permissions that an individual will
have for this con.
</li>
<li>conid: The con that these permission are for.  This should be set
to whatever conid you are creating.
</li>
</ul>

<p>
If you want to only add your particular badgeid, permroleid, conid
information, and then use the "Migrate Participant from another
con-instance" link under the "Manage Participants &amp; Schedule" tab 
to give each the right permissions, that will work as well.  But at
least you will need to be set up, so you can grant other people
access.  The use of that page is well documented in the
Presenter_Flow document in this directory.
</p>

<p>
You probably also want to add the 100-user (the Brainstorm User
called Idea Submissions), to permroleid 4 (Brainstorm) so that the
brainstorm submission system will work.
</p>
</div>
</div>

<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> UserHasConRole</h3>
<div class="outline-text-3" id="text-12-2">
<p>
This is very similar to the UserHasPermissionRole, and was split
off, because not all Permission Roles want to necessarily be
advertized, and sometimes a Permission Role is a superset of a Con
Role that actually wants to be called out.  While this is not a
necessary step, it is a good one to follow, so people know who is
responsible for what, when they visit your webpage. If you wish to
see who had which leadership roles in a previous instance of your
con (to make sure you are rolling forward with the right roles),
you might want to use a query (replacing the $conid with the
previous con you want to model on) like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat(badgeid," - ",pubsname) AS Who,
    concat(conroleid," - ",conrolename) AS What
  FROM
      UserHasConRole
    JOIN Participants USING (badgeid)
    JOIN ConRoles USING (conroleid)
  WHERE
    conid=$conid;
</pre>
</div>
<p>
This will give you the badgeids and conroleids to add to the
table.  It is in the format of:
</p>
<ul class="org-ul">
<li>badgeid: The unique id of an individual in Zambia.
</li>
<li>conroleid: A role that an individual will have for this con.
</li>
<li>conid: The con that the role is for.  This should be set to
whatever conid you are creating.
</li>
</ul>

<p>
You can always go back and add to this, as the shape of your con
fills in.
</p>

<p>
If you want to only add your particular badgeid, permroleid, conid
information, and then use the "Migrate Participant from another
con-instance" link under the "Manage Participants &amp; Schedule" tab 
to give each the right permissions, that will work as well.  But at
least you will need to be set up, so you can grant other people
access.  The use of that page is well documented in the
Presenter_Flow document in this directory.
</p>

<p>
You probably want to add the 100-user (the Brainstorm User called
Idea Submissions), to conroleid 47 (BrainstormCoord) for tracking
purposes.
</p>
</div>
</div>

<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> HasReports</h3>
<div class="outline-text-3" id="text-12-3">
<p>
This maps the organizational chart of your convention.  Again while
this is not a necessary step for the start of your con, and might
be added to as your con goes on, usually you know what the table of
your organization will be, even if you don't yet know who will be
filling those roles.  To see what was before you can use a query
(replacing the $conid with the previous con you want to model on)
like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat(HR.conroleid," - ",CR.conrolename) AS Role,
    concat(hasreport," - ",CRR.conrolename) AS Report
  FROM
      HasReports HR
    JOIN ConRoles CR USING (conroleid)
    JOIN ConRoles CRR ON (hasreport=CRR.conroleid)
  WHERE
    conid=$conid;
</pre>
</div>
<p>
This will give you the list of conroleids who have conroleids
reporting to them.  You can add them to the table as:
</p>
<ul class="org-ul">
<li>conid: The con that these reports are for.  This should be set
to whatever conid you are creating.
</li>
<li>conroleid: This is the role that has others reporting to them
</li>
<li>hasreport: The conroleid of the position that reports to the
specified original conroleid.
</li>
</ul>

<p>
On the other hand, if you just want to mirror them, quickly, from
another instance of your con you could always (replacing $origconid
with the previous con you want to model on, and $conid with the
current one) run:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat("($conid,",conroleid,",",hasreport,"),") AS Prev
  FROM
      HasReports
  WHERE
    conid=$origconid;
</pre>
</div>
<p>
Then just massage the data slightly, and you have the insert you
can do to mirror the previous con.
</p>

<p>
You probably want to make sure the BrainstormCoordinator (47),
reports to Programming (3).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Adding a year instance - Sessions</h2>
<div class="outline-text-2" id="text-13">
<p>
The sessions are mostly generated from Brainstorm (and other
insertions to your database) but there are a few settings that
should be taken care of, to make sure everything works smoothly.
The limits are set on an event basis, since sometimes publications
or the space for things to be advertized differs from year to year.
Also the requestables might change, depending on what is available,
as well as the rooms
</p>
</div>
