Documentation/Source/Setting_Up.org
** PublicationLimits
   This tracks the various limits on the publication fields, so that
   you can have restrictions on minimum and/or maximum length of these
   fields.  All the limit checks should be set up such that if you
   don't have a limit set in this table, the minimum is presumed 0 and
   the maximum is presumed to be whatever your database maximum is for
   that particular field.  If you wish to see what limits were set for
   a previous instance of your con (to make sure you have the right
   limits), you might want to use a query (replacing the $conid with
   the previous con you want to model on) like:
#+begin_src html :exports both :results silent
    SELECT
        *
      FROM
          PublicationLimits
      WHERE
        conid=$conid;
#+end_src
   The values are:
   + publimid: Unique key for this table (it should auto-increment).
   + conid: The con that these limits are for.  This should be set to
     whatever conid you are creating.
   + publimtype: This is an enum between two values, min and max.
     This determiines if the limit is a minimum limit, or maximum
     limit.
   + publimdest: This is an enum between web and book, and should be
     in sync with your BioDests table.  This is so you can set
     different limits for the various publication media.
   + publimname: This should be in sync with your BioTypes table, and
     is the specific field that is being limited.
   + publimval: The number of characters you are limiting this type of
     entry to.
   + publimnote: Any notes you want to have about the limit.

   On the other hand, if you just want to mirror them, quickly, from
   another instance of your con you could always (replacing $origconid
   with the previous con you want to model on, and $conid with the
   current one) run:
#+begin_src html :exports both :results silent
    SELECT
        concat("($conid,'",publimtype,"','",publimdest,"','",publimname,"',",publimval,",'",publimnote,"'),") AS Prev
      FROM
          PublicationLimits
      WHERE
        conid=$origconid;
#+end_src
   Then just massage the data slightly, and you have the insert you
   can do to mirror the previous con.
** Services and Features
   These two tables are built in the same pattern.  Services are the
   bits that logistics could get to the room, so they could be used
   for the class.  Some of the room features (speakers, microphone)
   fall under this, because of being extra cost.  Features are
   elements of the room that someone would look for.  With a single
   room, there might not be much there to choose between, but, with
   many rooms, or different room functions depending on the time of
   day (say, needing curtains in the daytime, and dimable lights, so
   that projection will work correctly) so scheduling can happen more
   easily.

   To select (or update the selection) of services and features
   available for this con-instance, use the AdminSetupServices.php
   page.

** Rooms
   This needs to be fleshed out more.
* Adding a year instance - Vendors
** VendorSpaces and VendorFeatures
   These two tables are built in the same pattern. VendorSpaces are
   the size/type of space, and the cost of said space for the con.
   VendorFeatures are all the little up-charges or non-standard things
   that a vendor might opt for.  To see what was set on a previous
   instance of your con, you can use a query (replacing the $conid
   with the previous con you want to model on) like:
#+begin_src html :exports both :results silent
    SELECT
        *
      FROM
          VendorSpaces
      WHERE
        conid=$conid;
#+end_src
   And:
#+begin_src html :exports both :results silent
    SELECT
        *
      FROM
          VendorFeatures
      WHERE
        conid=$conid;
#+end_src
   The values are:
   + vendorspaceid/vendorfeatureid: Unique id for the entry (key).
   + vendorspacename/vendorfeaturename: A description, plus the price
     in an easily understandable format, so the vendors know what to
     select for their comfort and profit.
   + vendorspaceprice/vendorfeatureprice: Numeric representation of
     the cost of said item, so the invoice can be generated
     correctly.
   + conid: The con that these things are available for .  This should
     be set to whatever conid you are creating.
   + display_order: For the select boxes, if you want to reorder
     possibilities, this forces the ordering to what you want it to
     be.

   On the other hand, if you just want to mirror them, quickly, from
   another instance of your con you could always (replacing $origconid
   with the previous con you want to model on, and $conid with the
   current one) run:
#+begin_src html :exports both :results silent
    SELECT
        concat("('",vendorspacename,"',",vendorspaceprice,",$conid,",display_order,"),") AS Prev
      FROM
          VendorSpaces
      WHERE
        conid=$origconid;
#+end_src
   And:
#+begin_src html :exports both :results silent
    SELECT
        concat("('",vendorfeaturename,"',",vendorfeatureprice,",$conid,",display_order,"),") AS Prev
      FROM
          VendorFeatures
      WHERE
        conid=$origconid;
#+end_src
   Then just massage the data slightly, and you have the insert you
   can do to mirror the previous con.
** More Vendor stuff, pending development.
* Adding a year instance - Feedback
  Setting up feedback for your con is somewhat complex.  I'm not sure
  what motivated me, originally to be so baroque, but I think it was
  flexibility at the time.
** Adding Questions
   If your questions are not appropriate for this particular event,
   you might want to add a question type to cover it, in the
   QuestionTypes table, and then add the questions to the
   QuestionsForSurvey table.

   The values for QuestionTypes are:
   + questiontypeid: Unique key for this table (it should auto-increment).
   + questiontypename: A one or two word name for the type of question.
   + questiontypenotes: A more indepth description of the question type.

   The values for the QuestionsForSurvey are:
   + questionid: Unique key for this table (it should auto-increment).
   + questiontext: The text of the question to be asked.
   + display_order: The order of the question to be asked.
   + questiontypeid: What type of question it is, referencing the
     QuestionTypes table above.
