Documentation/Setting_Up.html
<div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> PublicationLimits</h3>
<div class="outline-text-3" id="text-13-1">
<p>
This tracks the various limits on the publication fields, so that
you can have restrictions on minimum and/or maximum length of these
fields.  All the limit checks should be set up such that if you
don't have a limit set in this table, the minimum is presumed 0 and
the maximum is presumed to be whatever your database maximum is for
that particular field.  If you wish to see what limits were set for
a previous instance of your con (to make sure you have the right
limits), you might want to use a query (replacing the $conid with
the previous con you want to model on) like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    *
  FROM
      PublicationLimits
  WHERE
    conid=$conid;
</pre>
</div>
<p>
The values are:
</p>
<ul class="org-ul">
<li>publimid: Unique key for this table (it should auto-increment).
</li>
<li>conid: The con that these limits are for.  This should be set to
whatever conid you are creating.
</li>
<li>publimtype: This is an enum between two values, min and max.
This determiines if the limit is a minimum limit, or maximum
limit.
</li>
<li>publimdest: This is an enum between web and book, and should be
in sync with your BioDests table.  This is so you can set
different limits for the various publication media.
</li>
<li>publimname: This should be in sync with your BioTypes table, and
is the specific field that is being limited.
</li>
<li>publimval: The number of characters you are limiting this type of
entry to.
</li>
<li>publimnote: Any notes you want to have about the limit.
</li>
</ul>

<p>
On the other hand, if you just want to mirror them, quickly, from
another instance of your con you could always (replacing $origconid
with the previous con you want to model on, and $conid with the
current one) run:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat("($conid,'",publimtype,"','",publimdest,"','",publimname,"',",publimval,",'",publimnote,"'),") AS Prev
  FROM
      PublicationLimits
  WHERE
    conid=$origconid;
</pre>
</div>
<p>
Then just massage the data slightly, and you have the insert you
can do to mirror the previous con.
</p>
</div>
</div>

<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Services and Features</h3>
<div class="outline-text-3" id="text-13-2">
<p>
These two tables are built in the same pattern.  Services are the
bits that logistics could get to the room, so they could be used
for the class.  Some of the room features (speakers, microphone)
fall under this, because of being extra cost.  Features are
elements of the room that someone would look for.  With a single
room, there might not be much there to choose between, but, with
many rooms, or different room functions depending on the time of
day (say, needing curtains in the daytime, and dimable lights, so
that projection will work correctly) so scheduling can happen more
easily.
</p>

<p>
To select (or update the selection) of services and features
available for this con-instance, use the AdminSetupServices.php
page.
</p>
</div>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Rooms</h3>
<div class="outline-text-3" id="text-13-3">
<p>
This needs to be fleshed out more.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Adding a year instance - Vendors</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> VendorSpaces and VendorFeatures</h3>
<div class="outline-text-3" id="text-14-1">
<p>
These two tables are built in the same pattern. VendorSpaces are
the size/type of space, and the cost of said space for the con.
VendorFeatures are all the little up-charges or non-standard things
that a vendor might opt for.  To see what was set on a previous
instance of your con, you can use a query (replacing the $conid
with the previous con you want to model on) like:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    *
  FROM
      VendorSpaces
  WHERE
    conid=$conid;
</pre>
</div>
<p>
And:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    *
  FROM
      VendorFeatures
  WHERE
    conid=$conid;
</pre>
</div>
<p>
The values are:
</p>
<ul class="org-ul">
<li>vendorspaceid/vendorfeatureid: Unique id for the entry (key).
</li>
<li>vendorspacename/vendorfeaturename: A description, plus the price
in an easily understandable format, so the vendors know what to
select for their comfort and profit.
</li>
<li>vendorspaceprice/vendorfeatureprice: Numeric representation of
the cost of said item, so the invoice can be generated
correctly.
</li>
<li>conid: The con that these things are available for .  This should
be set to whatever conid you are creating.
</li>
<li>display_order: For the select boxes, if you want to reorder
possibilities, this forces the ordering to what you want it to
be.
</li>
</ul>

<p>
On the other hand, if you just want to mirror them, quickly, from
another instance of your con you could always (replacing $origconid
with the previous con you want to model on, and $conid with the
current one) run:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat("('",vendorspacename,"',",vendorspaceprice,",$conid,",display_order,"),") AS Prev
  FROM
      VendorSpaces
  WHERE
    conid=$origconid;
</pre>
</div>
<p>
And:
</p>
<div class="org-src-container">

<pre class="src src-html">SELECT
    concat("('",vendorfeaturename,"',",vendorfeatureprice,",$conid,",display_order,"),") AS Prev
  FROM
      VendorFeatures
  WHERE
    conid=$origconid;
</pre>
</div>
<p>
Then just massage the data slightly, and you have the insert you
can do to mirror the previous con.
</p>
</div>
</div>

<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> More Vendor stuff, pending development.</h3>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Adding a year instance - Feedback</h2>
<div class="outline-text-2" id="text-15">
<p>
Setting up feedback for your con is somewhat complex.  I'm not sure
what motivated me, originally to be so baroque, but I think it was
flexibility at the time.
</p>
</div>
<div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Adding Questions</h3>
<div class="outline-text-3" id="text-15-1">
<p>
If your questions are not appropriate for this particular event,
you might want to add a question type to cover it, in the
QuestionTypes table, and then add the questions to the
QuestionsForSurvey table.
</p>

<p>
The values for QuestionTypes are:
</p>
<ul class="org-ul">
<li>questiontypeid: Unique key for this table (it should auto-increment).
</li>
<li>questiontypename: A one or two word name for the type of question.
</li>
<li>questiontypenotes: A more indepth description of the question type.
</li>
</ul>

<p>
The values for the QuestionsForSurvey are:
</p>
<ul class="org-ul">
<li>questionid: Unique key for this table (it should auto-increment).
</li>
<li>questiontext: The text of the question to be asked.
</li>
<li>display_order: The order of the question to be asked.
</li>
<li>questiontypeid: What type of question it is, referencing the
QuestionTypes table above.
</li>
</ul>
</div>
</div>
