Documentation/Source/Setting_Up.org
** Setting up the page description (how it is presented)
   For your event, there might be several different feedback forms you
   want available, so that an individual isn't overwhelmed by the
   number of possible choices.  One of the ways to do this is to break
   it down by time period, another is to break it down by class type.
   Once you have broken them down, this table sets up the various
   possible views.  At least one view should be set to "single class",
   so that the reference from the descriptions etc will work.

   The values for FeedbackPages are:
   + fpageid: Unique key for this table (it should auto-increment).
   + conid: For which con is this page relevant.
   + fppagedesc: The short description of the page contents.
   + fpagestart: The start time of the schedule elements that this
     page covers.
   + fpageend: The end time of the schedule elements that this page
     covers.
   + fpagecols: The number of columns at the top of the printed page.
   + questiontypeid: Which type of questions will show up on this
     page, from the QuestionTypes table.

   The type of schedule elements included in each possible Feedback
   page is set in the FeedbackPageHasType.  This can have multiple
   mappings.  For example, if you have both classes and panels, they
   have different values for their typeid in the Sessions table.  To
   have them both show up in the "single class" page, that page id
   needs two entries in the FeedbackPageHasType table, each one
   mapping the typeid to that fpageid.  "single class" should have a
   mapping for every element you reference, but the feedback page for
   just the classes would only have the typeid of classes mapped to
   it.

   The values for FeedbackPageHasType are:
   + fpageid: From the FeedbackPages table.
   + typeid: From the Types table.
** Setting the TypeHasQuestionType
   This is implemented to be able to cross-type questions, and make
   sure you wanted those question types to show up for that type of
   schedule element, for this particular event.  It does allow for
   some greater flexibility, as opposed to having a fixed QuestionType
   for the schedule Type, since that might change from event to event.
   Smaller events might want all the schedule Types to have the same
   QuestionType, larger or more siloed events might want to break it
   down further.  Depending on what is being fed back, Divisions might
   creep into this, as well.

   The values for TypeHasQuestionType are:
   + typeid: From the Types table.
   + questiontypeid: From the QuestionTypes table.
   + conid: For which event is being run.
