Documentation/Setting_Up.html

<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> Setting up the page description (how it is presented)</h3>
<div class="outline-text-3" id="text-15-2">
<p>
For your event, there might be several different feedback forms you
want available, so that an individual isn't overwhelmed by the
number of possible choices.  One of the ways to do this is to break
it down by time period, another is to break it down by class type.
Once you have broken them down, this table sets up the various
possible views.  At least one view should be set to "single class",
so that the reference from the descriptions etc will work.
</p>

<p>
The values for FeedbackPages are:
</p>
<ul class="org-ul">
<li>fpageid: Unique key for this table (it should auto-increment).
</li>
<li>conid: For which con is this page relevant.
</li>
<li>fppagedesc: The short description of the page contents.
</li>
<li>fpagestart: The start time of the schedule elements that this
page covers.
</li>
<li>fpageend: The end time of the schedule elements that this page
covers.
</li>
<li>fpagecols: The number of columns at the top of the printed page.
</li>
<li>questiontypeid: Which type of questions will show up on this
page, from the QuestionTypes table.
</li>
</ul>

<p>
The type of schedule elements included in each possible Feedback
page is set in the FeedbackPageHasType.  This can have multiple
mappings.  For example, if you have both classes and panels, they
have different values for their typeid in the Sessions table.  To
have them both show up in the "single class" page, that page id
needs two entries in the FeedbackPageHasType table, each one
mapping the typeid to that fpageid.  "single class" should have a
mapping for every element you reference, but the feedback page for
just the classes would only have the typeid of classes mapped to
it.
</p>

<p>
The values for FeedbackPageHasType are:
</p>
<ul class="org-ul">
<li>fpageid: From the FeedbackPages table.
</li>
<li>typeid: From the Types table.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3"><span class="section-number-3">15.3</span> Setting the TypeHasQuestionType</h3>
<div class="outline-text-3" id="text-15-3">
<p>
This is implemented to be able to cross-type questions, and make
sure you wanted those question types to show up for that type of
schedule element, for this particular event.  It does allow for
some greater flexibility, as opposed to having a fixed QuestionType
for the schedule Type, since that might change from event to event.
Smaller events might want all the schedule Types to have the same
QuestionType, larger or more siloed events might want to break it
down further.  Depending on what is being fed back, Divisions might
creep into this, as well.
</p>

<p>
The values for TypeHasQuestionType are:
</p>
<ul class="org-ul">
<li>typeid: From the Types table.
</li>
<li>questiontypeid: From the QuestionTypes table.
</li>
<li>conid: For which event is being run.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: July 2011</p>
<p class="author">Author: Percy, Bendyogagirl</p>
<p class="email">Email: <a href="mailto:NELA.Percy@gmail.com">NELA.Percy@gmail.com</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>